Revit 2027 API
ElectricalSystem.BalancedLoad Property
 Reports whether the BalancedLoad is on or off.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BalancedLoad { get; }
Public ReadOnly Property BalancedLoad As Boolean
	Get
public:
property bool BalancedLoad {
	bool get ();
}
member BalancedLoad : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the BalancedLoad value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace